[TC_WOTC_S79_AK74M_T1 X2WeaponTemplate]
FriendlyName="<font color='#ECECEC'><b>AK-74M</b></font>"
FriendlyNamePlural="<font color='#ECECEC'><b>AK-74Ms</b></font>"
AbilityDescName="assault rifle"
BriefSummary="The Автомат Калашникова образца 1974 года, or Kalashnikov automatic rifle model 1974, is an adaptation of the AKM, except that it was redesigned to fire lighter 5.45x39mm. There are several notable difference compared to the AKM/AK47. The new cartridge, the 5.45x39mm, was favored over the old 7.62x39mm, due to the size and free recoil impulse. The AK74-M is pretty much the AK-74 but with minor improvments. The most notable change is the glass-filled polyamide stock, which side-folds to the side like the AKS and AKS-74 skeleton stocks."
TacticalText="<Bullet/>Type: Assault Rifle\n<Bullet/>Firing Profile: Full-Auto\n<Bullet/>Action: Gas-Operated, Rotating Bolt\n<Bullet/>Cartridge: 5.45x39mm\n<Bullet/>Origin: Soviet Union/Russia\n<Bullet/>Tier: Conventional"

[TC_WOTC_S79_AK74M_T2 X2WeaponTemplate]
FriendlyName="<font color='#27AAE1'><b>RVK-74M</b></font>"
FriendlyNamePlural="<font color='#27AAE1'><b>RVK-74Ms</b></font>"
AbilityDescName="assault rifle"
BriefSummary="The Автомат Калашникова образца 1974 года, or Kalashnikov automatic rifle model 1974, is an adaptation of the AKM, except that it was redesigned to fire lighter 5.45x39mm. There are several notable difference compared to the AKM/AK47. The new cartridge, the 5.45x39mm, was favored over the old 7.62x39mm, due to the size and free recoil impulse. The AK74-M is pretty much the AK-74 but with minor improvments. The most notable change is the glass-filled polyamide stock, which side-folds to the side like the AKS and AKS-74 skeleton stocks. \nThe RVK-74M carries the same improvements as the RVK-74. The high-pressure gas within the gas-operated firing system is replaced with a custom mixture of elerium and other gaseous products. The kinetic force of each profile is increased ten-fold, making the RVK-74 deadiler while reducing the kickback."
TacticalText="<Bullet/>Type: Assault Rifle\n<Bullet/>Firing Profile: Full-Auto\n<Bullet/>Action: Gas-Operated, Rotating Bolt\n<Bullet/>Cartridge: 5.45x39mm\n<Bullet/>Origin: Soviet Union/Russia\n<Bullet/>Tier: Magnetic"

[TC_WOTC_S79_AK74M_T3 X2WeaponTemplate]
FriendlyName="<font color='#CF4517'><b>RVK-74M/203X</b></font>"
FriendlyNamePlural="<font color='#CF4517'><b>RVK-74M/203Xs</b></font>"
AbilityDescName="assault rifle"
BriefSummary="The Автомат Калашникова образца 1974 года, or Kalashnikov automatic rifle model 1974, is an adaptation of the AKM, except that it was redesigned to fire lighter 5.45x39mm. There are several notable difference compared to the AKM/AK47. The new cartridge, the 5.45x39mm, was favored over the old 7.62x39mm, due to the size and free recoil impulse. The AK74-M is pretty much the AK-74 but with minor improvments. The most notable change is the glass-filled polyamide stock, which side-folds to the side like the AKS and AKS-74 skeleton stocks. \nIdentical improvements from the RVK-74/203X were made to the RVK-74M/203X. The barrel of the RVK-74/203X is custom made from alien alloy, and a counter-recoil dampening module is built within the weapon internal components, negating most of the recoil that the user might encounter when firing the RVK-74M/203X."
TacticalText="<Bullet/>Type: Assault Rifle\n<Bullet/>Firing Profile: Full-Auto\n<Bullet/>Action: Gas-Operated, Rotating Bolt\n<Bullet/>Cartridge: 5.45x39mm\n<Bullet/>Origin: Soviet Union/Russia\n<Bullet/>Tier: Beam"

[TC_WOTC_SKR_S79_AK74M_T1 X2WeaponTemplate]
FriendlyName="<font color='#ECECEC'><b>AK-74M</b></font>"
FriendlyNamePlural="<font color='#ECECEC'><b>AK-74Ms</b></font>"
AbilityDescName="assault rifle"
BriefSummary="The Автомат Калашникова образца 1974 года, or Kalashnikov automatic rifle model 1974, is an adaptation of the AKM, except that it was redesigned to fire lighter 5.45x39mm. There are several notable difference compared to the AKM/AK47. The new cartridge, the 5.45x39mm, was favored over the old 7.62x39mm, due to the size and free recoil impulse. The AK74-M is pretty much the AK-74 but with minor improvments. The most notable change is the glass-filled polyamide stock, which side-folds to the side like the AKS and AKS-74 skeleton stocks."
TacticalText="<Bullet/>Type: Assault Rifle\n<Bullet/>Firing Profile: Full-Auto\n<Bullet/>Action: Gas-Operated, Rotating Bolt\n<Bullet/>Cartridge: 5.45x39mm\n<Bullet/>Origin: Soviet Union/Russia\n<Bullet/>Tier: Conventional"

[TC_WOTC_SKR_S79_AK74M_T2 X2WeaponTemplate]
FriendlyName="<font color='#27AAE1'><b>RVK-74M</b></font>"
FriendlyNamePlural="<font color='#27AAE1'><b>RVK-74Ms</b></font>"
AbilityDescName="assault rifle"
BriefSummary="The Автомат Калашникова образца 1974 года, or Kalashnikov automatic rifle model 1974, is an adaptation of the AKM, except that it was redesigned to fire lighter 5.45x39mm. There are several notable difference compared to the AKM/AK47. The new cartridge, the 5.45x39mm, was favored over the old 7.62x39mm, due to the size and free recoil impulse. The AK74-M is pretty much the AK-74 but with minor improvments. The most notable change is the glass-filled polyamide stock, which side-folds to the side like the AKS and AKS-74 skeleton stocks. \nThe RVK-74M carries the same improvements as the RVK-74. The high-pressure gas within the gas-operated firing system is replaced with a custom mixture of elerium and other gaseous products. The kinetic force of each profile is increased ten-fold, making the RVK-74 deadiler while reducing the kickback."
TacticalText="<Bullet/>Type: Assault Rifle\n<Bullet/>Firing Profile: Full-Auto\n<Bullet/>Action: Gas-Operated, Rotating Bolt\n<Bullet/>Cartridge: 5.45x39mm\n<Bullet/>Origin: Soviet Union/Russia\n<Bullet/>Tier: Magnetic"

[TC_WOTC_SKR_S79_AK74M_T3 X2WeaponTemplate]
FriendlyName="<font color='#CF4517'><b>RVK-74M/203X</b></font>"
FriendlyNamePlural="<font color='#CF4517'><b>RVK-74M/203Xs</b></font>"
AbilityDescName="assault rifle"
BriefSummary="The Автомат Калашникова образца 1974 года, or Kalashnikov automatic rifle model 1974, is an adaptation of the AKM, except that it was redesigned to fire lighter 5.45x39mm. There are several notable difference compared to the AKM/AK47. The new cartridge, the 5.45x39mm, was favored over the old 7.62x39mm, due to the size and free recoil impulse. The AK74-M is pretty much the AK-74 but with minor improvments. The most notable change is the glass-filled polyamide stock, which side-folds to the side like the AKS and AKS-74 skeleton stocks. \nIdentical improvements from the RVK-74/203X were made to the RVK-74M/203X. The barrel of the RVK-74/203X is custom made from alien alloy, and a counter-recoil dampening module is built within the weapon internal components, negating most of the recoil that the user might encounter when firing the RVK-74M/203X."
TacticalText="<Bullet/>Type: Assault Rifle\n<Bullet/>Firing Profile: Full-Auto\n<Bullet/>Action: Gas-Operated, Rotating Bolt\n<Bullet/>Cartridge: 5.45x39mm\n<Bullet/>Origin: Soviet Union/Russia\n<Bullet/>Tier: Beam"